PANDAS 

Pandas is an open Source Library used to work with 2D  DataFrames and 2D array.It provides various structure and operations to do on a numerical data with help of NUMPY and PANDAS both.
Pandas is fast and it had high performance & productivity for users.
It was developed in year 2008 by Wes Mckinney.

Why we use Pandas?
Fast & Efficient for manupulating and analyzing the data.
Data from different objects can be easily loaded here
Flexible reshaping of datasets.

The Data produced by Pandas are often used as input for Visualization purpose using multiple another sources and libraries like Matplotlib & Seaborn.
We can do data cleansing,merging and joining of data's through PANDAS.

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (2.2.0)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: C:\Users\Admin\AppData\Local\Programs\Python\Python312\python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

C:\Users\Admin\AppData\Local\Temp\ipykernel_13444\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
#Create a data from list

x=["Satvika","Payal","Mohan","Harry","George","Ketan","Pratik"]
print(x)

['Satvika', 'Payal', 'Mohan', 'Harry', 'George', 'Ketan', 'Pratik']

In [4]:
Data=pd.DataFrame(x)#Converting list into Data with DataFrame function
Data
#Column Index starts with 0 and even row index also starts with 0 in DF

         0
0  Satvika
1    Payal
2    Mohan
3    Harry
4   George
5    Ketan
6   Pratik

In [9]:
#creating data from dictionary 

dict1={"Name":["Satvika","Payal","Mohan","Jinal","Pratik","Leena","George","Pinky"],
       "Age":[29,25,23,24,22,21,20,24],
       "City":["Mumbai","Palghar","Thane","Chennai","Pune","Hyderabad","Mumbai","Pune"]}
print(dict1)

{'Name': ['Satvika', 'Payal', 'Mohan', 'Jinal', 'Pratik', 'Leena', 'George', 'Pinky'], 'Age': [29, 25, 23, 24, 22, 21, 20, 24], 'City': ['Mumbai', 'Palghar', 'Thane', 'Chennai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune']}

In [10]:
Student=pd.DataFrame(dict1)
Student

      Name  Age       City
0  Satvika   29     Mumbai
1    Payal   25    Palghar
2    Mohan   23      Thane
3    Jinal   24    Chennai
4   Pratik   22       Pune
5    Leena   21  Hyderabad
6   George   20     Mumbai
7    Pinky   24       Pune

In [11]:
#To access one column

Student["Name"]

0    Satvika
1      Payal
2      Mohan
3      Jinal
4     Pratik
5      Leena
6     George
7      Pinky
Name: Name, dtype: object

In [13]:
#to access multiple column

Student[["Name","City"]] 
#When we want to access more than 1 column we have to write column headers in 2D array

      Name       City
0  Satvika     Mumbai
1    Payal    Palghar
2    Mohan      Thane
3    Jinal    Chennai
4   Pratik       Pune
5    Leena  Hyderabad
6   George     Mumbai
7    Pinky       Pune

In [14]:
#To access details of certain row

Student.iloc[3] #iloc===index location ==it is inbuilt function in pandas

Name      Jinal
Age          24
City    Chennai
Name: 3, dtype: object

In [18]:
Student.iloc[5,2] #row index,column index
print("City of 5th Index:",Student.iloc[5,2])

City of 5th Index: Hyderabad

In [23]:
#Name & Age of last row 

print("Name of last row:",Student.iloc[-1,0])
print("Age of last row:",Student.iloc[-1,1])

Name of last row: Pinky
Age of last row: 24

In [25]:
Student.loc[5,"City"] #loc ===location of certain row index and column name

'Hyderabad'

In [28]:
Student.loc[6,"Age"] #In loc function we cant negative indexing we should know row index

20

In [29]:
#3rd technique

Student["Name"][3] #simple indexing===columnname,row index

'Jinal'

In [30]:
Student

      Name  Age       City
0  Satvika   29     Mumbai
1    Payal   25    Palghar
2    Mohan   23      Thane
3    Jinal   24    Chennai
4   Pratik   22       Pune
5    Leena   21  Hyderabad
6   George   20     Mumbai
7    Pinky   24       Pune

In [31]:
#TO ACCESS MULTIPLE ROWS & COLUMNS TOGETHER

Student.iloc[0:5]

      Name  Age     City
0  Satvika   29   Mumbai
1    Payal   25  Palghar
2    Mohan   23    Thane
3    Jinal   24  Chennai
4   Pratik   22     Pune

In [32]:
Student.iloc[0::2] #EVERY ALTERNATE ROWS from start to end

      Name  Age    City
0  Satvika   29  Mumbai
2    Mohan   23   Thane
4   Pratik   22    Pune
6   George   20  Mumbai

In [35]:
#retreive first 5 rows of Name and City

Student.iloc[0:6,0::2] #iloc.[row slicing,column slicing]

      Name       City
0  Satvika     Mumbai
1    Payal    Palghar
2    Mohan      Thane
3    Jinal    Chennai
4   Pratik       Pune
5    Leena  Hyderabad

In [36]:
Student.columns #To check all the column names

Index(['Name', 'Age', 'City'], dtype='object')

In [37]:
Student.info() #To check information about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   City    8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [38]:
Student.shape #no of rows and columns in your data

(8, 3)

In [39]:
#To extract column name with index position

for i,c in enumerate(Student.columns):
    print(i,c)

0 Name
1 Age
2 City

In [40]:
IPL=pd.read_clipboard() 
#read_clipboard is a function which will read the data which is
#been copied in clipboard
IPL

,Year,Winner,Won By,Runner Up,Venue
0,2023,Chennai Super Kings,5 wickets,Gujarat Titans,Ahmedabad
1,2022,Gujarat Titans,7 wickets,Rajasthan Royals,Ahmedabad
2,2021,Chennai Super Kings,27 runs,Kolkata Knight Riders,Dubai
3,2020,Mumbai Indians,5 wickets,Delhi Capitals,Dubai
4,2019,Mumbai Indians,1 run,Chennai Super Kings,Hyderabad
5,2018,Chennai Super Kings,8 wickets,Sunrisers Hyderabad,Mumbai
6,2017,Mumbai Indians,1 run,Rising Pune Supergiants,Hyderabad
7,2016,Sunrisers Hyderabad,8 runs,Royal Challengers Bangalore,Bangalore
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore
10,2013,Mumbai Indians,23 runs,Chennai Super Kings,Kolkata
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [41]:
IPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       16 non-null     int64
 1   Winner     16 non-null     object
 2   Won By     16 non-null     object
 3   Runner Up  16 non-null     object
 4   Venue      16 non-null     object
dtypes: int64(1), object(4)
memory usage: 772.0+ bytes

In [42]:
IPL.shape

(16, 5)

In [43]:
IPL.columns

Index(['Year', 'Winner', 'Won By', 'Runner Up', 'Venue'], dtype='object')

In [44]:
#top/first 5 rows

IPL.head() #Bydefault head function gives us first 5 row

   Year               Winner     Won By              Runner Up      Venue
0  2023  Chennai Super Kings  5 wickets         Gujarat Titans  Ahmedabad
1  2022       Gujarat Titans  7 wickets       Rajasthan Royals  Ahmedabad
2  2021  Chennai Super Kings    27 runs  Kolkata Knight Riders      Dubai
3  2020       Mumbai Indians  5 wickets         Delhi Capitals      Dubai
4  2019       Mumbai Indians      1 run    Chennai Super Kings  Hyderabad

In [45]:
#first 10 row

IPL.head(10) #insert number of rows inside the bracket to fetch certain rows

,Year,Winner,Won By,Runner Up,Venue
0,2023,Chennai Super Kings,5 wickets,Gujarat Titans,Ahmedabad
1,2022,Gujarat Titans,7 wickets,Rajasthan Royals,Ahmedabad
2,2021,Chennai Super Kings,27 runs,Kolkata Knight Riders,Dubai
3,2020,Mumbai Indians,5 wickets,Delhi Capitals,Dubai
4,2019,Mumbai Indians,1 run,Chennai Super Kings,Hyderabad
5,2018,Chennai Super Kings,8 wickets,Sunrisers Hyderabad,Mumbai
6,2017,Mumbai Indians,1 run,Rising Pune Supergiants,Hyderabad
7,2016,Sunrisers Hyderabad,8 runs,Royal Challengers Bangalore,Bangalore
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore

In [46]:
#last/bottom 5 rows

IPL.tail() #bydefault last 5 rows

,Year,Winner,Won By,Runner Up,Venue
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [47]:
#lAST 8 ROWS
IPL.tail(8)

,Year,Winner,Won By,Runner Up,Venue
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore
10,2013,Mumbai Indians,23 runs,Chennai Super Kings,Kolkata
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [48]:
IPL

,Year,Winner,Won By,Runner Up,Venue
0,2023,Chennai Super Kings,5 wickets,Gujarat Titans,Ahmedabad
1,2022,Gujarat Titans,7 wickets,Rajasthan Royals,Ahmedabad
2,2021,Chennai Super Kings,27 runs,Kolkata Knight Riders,Dubai
3,2020,Mumbai Indians,5 wickets,Delhi Capitals,Dubai
4,2019,Mumbai Indians,1 run,Chennai Super Kings,Hyderabad
5,2018,Chennai Super Kings,8 wickets,Sunrisers Hyderabad,Mumbai
6,2017,Mumbai Indians,1 run,Rising Pune Supergiants,Hyderabad
7,2016,Sunrisers Hyderabad,8 runs,Royal Challengers Bangalore,Bangalore
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore
10,2013,Mumbai Indians,23 runs,Chennai Super Kings,Kolkata
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [49]:
#To fetch only winner columns data

IPL["Winner"]

0       Chennai Super Kings
1            Gujarat Titans
2       Chennai Super Kings
3            Mumbai Indians
4            Mumbai Indians
5       Chennai Super Kings
6            Mumbai Indians
7       Sunrisers Hyderabad
8            Mumbai Indians
9     Kolkata Knight Riders
10           Mumbai Indians
11    Kolkata Knight Riders
12      Chennai Super Kings
13      Chennai Super Kings
14          Deccan Chargers
15         Rajasthan Royals
Name: Winner, dtype: object

In [50]:
#to fetch winner,won by,venue

IPL[["Winner","Won By","Venue"]]

                   Winner     Won By         Venue
0     Chennai Super Kings  5 wickets     Ahmedabad
1          Gujarat Titans  7 wickets     Ahmedabad
2     Chennai Super Kings    27 runs         Dubai
3          Mumbai Indians  5 wickets         Dubai
4          Mumbai Indians      1 run     Hyderabad
5     Chennai Super Kings  8 wickets        Mumbai
6          Mumbai Indians      1 run     Hyderabad
7     Sunrisers Hyderabad     8 runs     Bangalore
8          Mumbai Indians    41 runs       Kolkata
9   Kolkata Knight Riders  3 wickets     Bangalore
10         Mumbai Indians    23 runs       Kolkata
11  Kolkata Knight Riders  5 wickets       Chennai
12    Chennai Super Kings    58 runs       Chennai
13    Chennai Super Kings    22 runs        Mumbai
14        Deccan Chargers     6 runs  Johannesburg
15       Rajasthan Royals  3 wickets        Mumbai

In [53]:
#To check unique data of particular column

IPL["Winner"].unique()

array(['Chennai Super Kings', 'Gujarat Titans', 'Mumbai Indians',
       'Sunrisers Hyderabad', 'Kolkata Knight Riders', 'Deccan Chargers',
       'Rajasthan Royals'], dtype=object)

In [57]:
#To check unique of all columns

for col in IPL:
    print(col,":",IPL[col].unique())
    print("****************************************")

Year : [2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010
 2009 2008]
****************************************
Winner : ['Chennai Super Kings' 'Gujarat Titans' 'Mumbai Indians'
 'Sunrisers Hyderabad' 'Kolkata Knight Riders' 'Deccan Chargers'
 'Rajasthan Royals']
****************************************
Won By : ['5 wickets' '7 wickets' '27 runs' '1 run' '8 wickets' '8 runs' '41 runs'
 '3 wickets' '23 runs' '58 runs' '22 runs' '6 runs']
****************************************
Runner Up : ['Gujarat Titans' 'Rajasthan Royals' 'Kolkata Knight Riders'
 'Delhi Capitals' 'Chennai Super Kings' 'Sunrisers Hyderabad'
 'Rising Pune Supergiants' 'Royal Challengers Bangalore' 'Kings XI Punjab'
 'Mumbai Indians']
****************************************
Venue : ['Ahmedabad' 'Dubai' 'Hyderabad' 'Mumbai' 'Bangalore' 'Kolkata' 'Chennai'
 'Johannesburg']
****************************************

In [58]:
#FILTERING THE DATA 

#condition to check where it is true & where it is False
IPL["Winner"]=="Mumbai Indians"

0     False
1     False
2     False
3      True
4      True
5     False
6      True
7     False
8      True
9     False
10     True
11    False
12    False
13    False
14    False
15    False
Name: Winner, dtype: bool

In [59]:
IPL[IPL["Winner"]=="Mumbai Indians"] #conditional filtering
#DF[DF[Columname]==Condition]

#this suntax works as  a conditional filtering of data

    Year          Winner     Won By                Runner Up      Venue
3   2020  Mumbai Indians  5 wickets           Delhi Capitals      Dubai
4   2019  Mumbai Indians      1 run      Chennai Super Kings  Hyderabad
6   2017  Mumbai Indians      1 run  Rising Pune Supergiants  Hyderabad
8   2015  Mumbai Indians    41 runs      Chennai Super Kings    Kolkata
10  2013  Mumbai Indians    23 runs      Chennai Super Kings    Kolkata

In [60]:
MI=IPL[IPL["Winner"]=="Mumbai Indians"]
MI

    Year          Winner     Won By                Runner Up      Venue
3   2020  Mumbai Indians  5 wickets           Delhi Capitals      Dubai
4   2019  Mumbai Indians      1 run      Chennai Super Kings  Hyderabad
6   2017  Mumbai Indians      1 run  Rising Pune Supergiants  Hyderabad
8   2015  Mumbai Indians    41 runs      Chennai Super Kings    Kolkata
10  2013  Mumbai Indians    23 runs      Chennai Super Kings    Kolkata